SeeedJP/Adafruit_nRF52_Arduino/cores/nRF5/nordic/nrfx/haly/nrfy_spim.h
/** @refhal{nrf_spim_event_clear} */
NRFY_STATIC_INLINE void nrfy_spim_event_clear(NRF_SPIM_Type * p_reg, nrf_spim_event_t event)
{
    nrf_spim_event_clear(p_reg, event);
    nrf_barrier_w();
}

/** @refhal{nrf_spim_event_check} */
NRFY_STATIC_INLINE bool nrfy_spim_event_check(NRF_SPIM_Type const * p_reg, nrf_spim_event_t event)
{
    nrf_barrier_r();
    bool check = nrf_spim_event_check(p_reg, event);
    nrf_barrier_r();
    return check;
}

/** @refhal{nrf_spim_event_address_get} */
NRFY_STATIC_INLINE uint32_t nrfy_spim_event_address_get(NRF_SPIM_Type const * p_reg,
                                                        nrf_spim_event_t      event)
{
    return nrf_spim_event_address_get(p_reg, event);
}

/** @refhal{nrf_spim_shorts_enable} */
NRFY_STATIC_INLINE void nrfy_spim_shorts_enable(NRF_SPIM_Type * p_reg, uint32_t mask)
{
    nrf_spim_shorts_enable(p_reg, mask);
    nrf_barrier_w();
}

/** @refhal{nrf_spim_shorts_disable} */
NRFY_STATIC_INLINE void nrfy_spim_shorts_disable(NRF_SPIM_Type * p_reg, uint32_t mask)
{
    nrf_spim_shorts_disable(p_reg, mask);
    nrf_barrier_w();
}

/** @refhal{nrf_spim_shorts_get} */
NRFY_STATIC_INLINE uint32_t nrfy_spim_shorts_get(NRF_SPIM_Type const * p_reg)
{
    nrf_barrier_rw();
    uint32_t shorts = nrf_spim_shorts_get(p_reg);
    nrf_barrier_r();
    return shorts;
}

/** @refhal{nrf_spim_int_enable} */
NRFY_STATIC_INLINE void nrfy_spim_int_enable(NRF_SPIM_Type * p_reg, uint32_t mask)
{
    nrf_spim_int_enable(p_reg, mask);
    nrf_barrier_w();
}

/** @refhal{nrf_spim_int_disable} */
NRFY_STATIC_INLINE void nrfy_spim_int_disable(NRF_SPIM_Type * p_reg, uint32_t mask)
{
    nrf_spim_int_disable(p_reg, mask);
    nrf_barrier_w();
}

/** @refhal{nrf_spim_int_enable_check} */
NRFY_STATIC_INLINE uint32_t nrfy_spim_int_enable_check(NRF_SPIM_Type const * p_reg, uint32_t mask)
{
    nrf_barrier_rw();
    uint32_t check = nrf_spim_int_enable_check(p_reg, mask);
    nrf_barrier_r();
    return check;
}

#if defined(DPPI_PRESENT) || defined(__NRFX_DOXYGEN__)
/** @refhal{nrf_spim_subscribe_set} */
NRFY_STATIC_INLINE void nrfy_spim_subscribe_set(NRF_SPIM_Type * p_reg,
                                                nrf_spim_task_t task,
                                                uint8_t         channel)
{
    nrf_spim_subscribe_set(p_reg, task, channel);
    nrf_barrier_w();
}

/** @refhal{nrf_spim_subscribe_clear} */
NRFY_STATIC_INLINE void nrfy_spim_subscribe_clear(NRF_SPIM_Type * p_reg,
                                                  nrf_spim_task_t task)
{
    nrf_spim_subscribe_clear(p_reg, task);
    nrf_barrier_w();
}

/** @refhal{nrf_spim_publish_set} */
NRFY_STATIC_INLINE void nrfy_spim_publish_set(NRF_SPIM_Type *  p_reg,
                                              nrf_spim_event_t event,
                                              uint8_t          channel)
{
    nrf_spim_publish_set(p_reg, event, channel);
    nrf_barrier_w();
}

/** @refhal{nrf_spim_publish_clear} */
NRFY_STATIC_INLINE void nrfy_spim_publish_clear(NRF_SPIM_Type *  p_reg,
                                                nrf_spim_event_t event)
{
    nrf_spim_publish_clear(p_reg, event);
    nrf_barrier_w();
}
#endif // defined(DPPI_PRESENT) || defined(__NRFX_DOXYGEN__)

/** @refhal{nrf_spim_enable} */
NRFY_STATIC_INLINE void nrfy_spim_enable(NRF_SPIM_Type * p_reg)
{
    nrf_spim_enable(p_reg);
    nrf_barrier_w();
}

/** @refhal{nrf_spim_disable} */
NRFY_STATIC_INLINE void nrfy_spim_disable(NRF_SPIM_Type * p_reg)
{
    nrf_spim_disable(p_reg);
    nrf_barrier_w();
}

/** @refhal{nrf_spim_enable_check} */
NRFY_STATIC_INLINE bool nrfy_spim_enable_check(NRF_SPIM_Type const * p_reg)
{
    nrf_barrier_rw();
    bool check = nrf_spim_enable_check(p_reg);
    nrf_barrier_r();
    return check;
}

/** @refhal{nrf_spim_pins_set} */
NRFY_STATIC_INLINE void nrfy_spim_pins_set(NRF_SPIM_Type * p_reg,
                                           uint32_t        sck_pin,
                                           uint32_t        mosi_pin,
                                           uint32_t        miso_pin)
{
    nrf_spim_pins_set(p_reg, sck_pin, mosi_pin, miso_pin);
    nrf_barrier_w();
}

/** @refhal{nrf_spim_sck_pin_get} */
NRFY_STATIC_INLINE uint32_t nrfy_spim_sck_pin_get(NRF_SPIM_Type const * p_reg)
{
    nrf_barrier_rw();
    uint32_t pin = nrf_spim_sck_pin_get(p_reg);
    nrf_barrier_r();
    return pin;
}

/** @refhal{nrf_spim_mosi_pin_get} */
NRFY_STATIC_INLINE uint32_t nrfy_spim_mosi_pin_get(NRF_SPIM_Type const * p_reg)
{
    nrf_barrier_rw();
    uint32_t pin = nrf_spim_mosi_pin_get(p_reg);
    nrf_barrier_r();
    return pin;
}

/** @refhal{nrf_spim_miso_pin_get} */
NRFY_STATIC_INLINE uint32_t nrfy_spim_miso_pin_get(NRF_SPIM_Type const * p_reg)
{
    nrf_barrier_rw();
    uint32_t pin = nrf_spim_miso_pin_get(p_reg);
    nrf_barrier_r();
    return pin;
}


#if NRFY_SPIM_HAS_HW_CSN
/** @refhal{nrf_spim_csn_configure} */
NRFY_STATIC_INLINE void nrfy_spim_csn_configure(NRF_SPIM_Type *    p_reg,
                                                uint32_t           pin,
                                                nrf_spim_csn_pol_t polarity,
                                                uint32_t           duration)
{
    nrf_spim_csn_configure(p_reg, pin, polarity, duration);
    nrf_barrier_w();
}

/** @refhal{nrf_spim_csn_pin_get} */
NRFY_STATIC_INLINE uint32_t nrfy_spim_csn_pin_get(NRF_SPIM_Type const * p_reg)
{
    nrf_barrier_rw();
    uint32_t pin = nrf_spim_csn_pin_get(p_reg);
    nrf_barrier_r();
    return pin;
}
#endif

#if NRFY_SPIM_HAS_DCX
/** @refhal{nrf_spim_dcx_pin_set} */
NRFY_STATIC_INLINE void nrfy_spim_dcx_pin_set(NRF_SPIM_Type * p_reg,
                                              uint32_t        dcx_pin)
{
    nrf_spim_dcx_pin_set(p_reg, dcx_pin);
    nrf_barrier_w();
}

/** @refhal{nrf_spim_dcx_pin_get} */
NRFY_STATIC_INLINE uint32_t nrfy_spim_dcx_pin_get(NRF_SPIM_Type const * p_reg)
{
    nrf_barrier_rw();
    uint32_t pin = nrf_spim_dcx_pin_get(p_reg);
    nrf_barrier_r();
    return pin;
}

