SeeedJP/Adafruit_nRF52_Arduino/cores/nRF5/nordic/nrfx/haly/nrfy_spim.h
/** @refhal{nrf_spim_dcx_cnt_set} */
NRFY_STATIC_INLINE void nrfy_spim_dcx_cnt_set(NRF_SPIM_Type * p_reg, uint32_t count)
{
    nrf_spim_dcx_cnt_set(p_reg, count);
    nrf_barrier_w();
}
#endif

#if NRFY_SPIM_HAS_RXDELAY
/** @refhal{nrf_spim_iftiming_set} */
NRFY_STATIC_INLINE void nrfy_spim_iftiming_set(NRF_SPIM_Type * p_reg,
                                               uint32_t        rxdelay)
{
    nrf_spim_iftiming_set(p_reg, rxdelay);
    nrf_barrier_w();
}
#endif

#if NRFY_SPIM_HAS_STALLSTAT
/** @refhal{nrf_spim_stallstat_rx_clear} */
NRFY_STATIC_INLINE void nrfy_spim_stallstat_rx_clear(NRF_SPIM_Type * p_reg)
{
    nrf_spim_stallstat_rx_clear(p_reg);
    nrf_barrier_w();
}

/** @refhal{nrf_spim_stallstat_rx_get} */
NRFY_STATIC_INLINE bool nrfy_spim_stallstat_rx_get(NRF_SPIM_Type const * p_reg)
{
    nrf_barrier_rw();
    bool stallstat = nrf_spim_stallstat_rx_get(p_reg);
    nrf_barrier_r();
    return stallstat;
}

/** @refhal{nrf_spim_stallstat_tx_clear} */
NRFY_STATIC_INLINE void nrfy_spim_stallstat_tx_clear(NRF_SPIM_Type * p_reg)
{
    nrf_spim_stallstat_tx_clear(p_reg);
    nrf_barrier_w();
}

/** @refhal{nrf_spim_stallstat_tx_get} */
NRFY_STATIC_INLINE bool nrfy_spim_stallstat_tx_get(NRF_SPIM_Type const * p_reg)
{
    nrf_barrier_rw();
    bool stallstat = nrf_spim_stallstat_tx_get(p_reg);
    nrf_barrier_r();
    return stallstat;
}
#endif // NRFY_SPIM_HAS_STALLSTAT

#if NRFY_SPIM_HAS_FREQUENCY
/** @refhal{nrf_spim_frequency_set} */
NRFY_STATIC_INLINE void nrfy_spim_frequency_set(NRF_SPIM_Type *      p_reg,
                                                nrf_spim_frequency_t frequency)
{
    nrf_spim_frequency_set(p_reg, frequency);
    nrf_barrier_w();
}
#endif

#if NRFY_SPIM_HAS_PRESCALER
/** @refhal{nrf_spim_prescaler_set} */
NRFY_STATIC_INLINE void nrfy_spim_prescaler_set(NRF_SPIM_Type * p_reg, uint32_t prescaler)
{
    nrf_spim_prescaler_set(p_reg, prescaler);
    nrf_barrier_w();
}

/** @refhal{nrf_spim_prescaler_get} */
NRFY_STATIC_INLINE uint32_t nrfy_spim_prescaler_get(NRF_SPIM_Type const * p_reg)
{
    nrf_barrier_rw();
    uint32_t prescaler = nrf_spim_prescaler_get(p_reg);
    nrf_barrier_r();
    return prescaler;
}
#endif

/** @refhal{nrf_spim_tx_buffer_set} */
NRFY_STATIC_INLINE void nrfy_spim_tx_buffer_set(NRF_SPIM_Type * p_reg,
                                                uint8_t const * p_buffer,
                                                size_t          length)
{
    nrf_spim_tx_buffer_set(p_reg, p_buffer, length);
    nrf_barrier_w();
}

/** @refhal{nrf_spim_tx_amount_get} */
NRFY_STATIC_INLINE uint32_t nrfy_spim_tx_amount_get(NRF_SPIM_Type const * p_reg)
{
    nrf_barrier_r();
    uint32_t amount = nrf_spim_tx_amount_get(p_reg);
    nrf_barrier_r();
    return amount;
}

/** @refhal{nrf_spim_tx_maxcnt_get} */
NRFY_STATIC_INLINE uint32_t nrfy_spim_tx_maxcnt_get(NRF_SPIM_Type const * p_reg)
{
    nrf_barrier_rw();
    uint32_t maxcnt = nrf_spim_tx_maxcnt_get(p_reg);
    nrf_barrier_r();
    return maxcnt;
}

/** @refhal{nrf_spim_rx_buffer_set} */
NRFY_STATIC_INLINE void nrfy_spim_rx_buffer_set(NRF_SPIM_Type * p_reg,
                                                uint8_t *       p_buffer,
                                                size_t          length)
{
    nrf_spim_rx_buffer_set(p_reg, p_buffer, length);
    nrf_barrier_w();
}

/** @refhal{nrf_spim_tx_amount_get} */
NRFY_STATIC_INLINE uint32_t nrfy_spim_rx_amount_get(NRF_SPIM_Type const * p_reg)
{
    nrf_barrier_r();
    uint32_t amount = nrf_spim_rx_amount_get(p_reg);
    nrf_barrier_r();
    return amount;
}

/** @refhal{nrf_spim_rx_maxcnt_get} */
NRFY_STATIC_INLINE uint32_t nrfy_spim_rx_maxcnt_get(NRF_SPIM_Type const * p_reg)
{
    nrf_barrier_rw();
    uint32_t maxcnt = nrf_spim_rx_maxcnt_get(p_reg);
    nrf_barrier_r();
    return maxcnt;
}

/** @refhal{nrf_spim_configure} */
NRFY_STATIC_INLINE void nrfy_spim_configure(NRF_SPIM_Type *      p_reg,
                                            nrf_spim_mode_t      spi_mode,
                                            nrf_spim_bit_order_t spi_bit_order)
{
    nrf_spim_configure(p_reg, spi_mode, spi_bit_order);
    nrf_barrier_w();
}

/** @refhal{nrf_spim_orc_set} */
NRFY_STATIC_INLINE void nrfy_spim_orc_set(NRF_SPIM_Type * p_reg,
                                          uint8_t         orc)
{
    nrf_spim_orc_set(p_reg, orc);
    nrf_barrier_w();
}

/** @} */

NRFY_STATIC_INLINE bool __nrfy_internal_spim_event_handle(NRF_SPIM_Type *  p_reg,
                                                          uint32_t         mask,
                                                          nrf_spim_event_t event,
                                                          uint32_t *       p_evt_mask)
{
    if ((mask & NRFY_EVENT_TO_INT_BITMASK(event)) && nrf_spim_event_check(p_reg, event))
    {
        nrf_spim_event_clear(p_reg, event);
        if (p_evt_mask)
        {
            *p_evt_mask |= NRFY_EVENT_TO_INT_BITMASK(event);
        }
        return true;
    }
    return false;
}

NRFY_STATIC_INLINE
uint32_t __nrfy_internal_spim_events_process(NRF_SPIM_Type *               p_reg,
                                             uint32_t                      mask,
                                             nrfy_spim_xfer_desc_t const * p_xfer)
{
    uint32_t evt_mask = 0;

    nrf_barrier_r();
    (void)__nrfy_internal_spim_event_handle(p_reg, mask, NRF_SPIM_EVENT_STARTED, &evt_mask);

    bool stop = __nrfy_internal_spim_event_handle(p_reg, mask, NRF_SPIM_EVENT_STOPPED, &evt_mask);

    bool invalidated = false;
    if (__nrfy_internal_spim_event_handle(p_reg, mask, NRF_SPIM_EVENT_END, &evt_mask) && p_xfer)
    {
        [[maybe_unused]] size_t size = stop ? nrf_spim_rx_amount_get(p_reg) : p_xfer->rx_length;
        NRFY_CACHE_INV(p_xfer->p_rx_buffer, size);
        invalidated = true;
    }

    if (__nrfy_internal_spim_event_handle(p_reg, mask, NRF_SPIM_EVENT_ENDRX, &evt_mask) &&
        p_xfer && !invalidated)
    {
        [[maybe_unused]] size_t size = stop ? nrf_spim_rx_amount_get(p_reg) : p_xfer->rx_length;
        NRFY_CACHE_INV(p_xfer->p_rx_buffer, size);
    }

    (void)__nrfy_internal_spim_event_handle(p_reg, mask, NRF_SPIM_EVENT_ENDTX, &evt_mask);

    return evt_mask;
}

NRFY_STATIC_INLINE void __nrfy_internal_spim_event_enabled_clear(NRF_SPIM_Type *  p_reg,
                                                                 uint32_t         mask,
                                                                 nrf_spim_event_t event)
{
    if (mask & NRFY_EVENT_TO_INT_BITMASK(event))
    {
        nrf_spim_event_clear(p_reg, event);
    }
}

#ifdef __cplusplus
}
#endif

#endif // NRFY_SPIM_H__
